InformationRegisters/ДанныеДляОтчетаНиссан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДляОтчетаНиссан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаказНарядСуммаРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказНарядСуммаДеталей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаказНарядТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНарядНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНарядДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасов</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРемонта</Name>
			<Comment>Типы ремонта (платный/бесплатный)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платный</Name>
					<Comment>Ремонт платный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесплатный</Name>
					<Comment>Ремонт бесплатный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ПроцедурыДляNissanAftersales/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////
// Процедуры для Customer360 After-Sales
///////////////////////////////////////////////////////////////////////

Процедура ВыгрузкаДляNissanAftersales(Параметры = Неопределено) Экспорт
	ТекущаяДата = НачалоДня(ТекущаяДата());
	//ТекущаяДата = Дата(2018, 5, 3); // дата для тестирования
	
	ПодразделениеШахты = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160");	
	////СтрокаАутентификации = "21112401\dealer_int:demo_123"; // Аутентификация Ниссан Шахты для тестового сервера
	СтрокаАутентификации = "21112401\integr_sh:12401sh"; // Аутентификация Ниссан Шахты
	ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, ПодразделениеШахты, ТекущаяДата);
	
	СтрокаАутентификации = "21409201\integr_sh:Olimp62"; // Аутентификация Датсун Шахты
	ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, ПодразделениеШахты, ТекущаяДата);
	
	ПодразделениеВолгодонск = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190");
	//СтрокаАутентификации = "21115701\dealer_int:demo_123"; // Аутентификация Ниссан Волгодонск для тестового сервера
	СтрокаАутентификации = "21115701\integr_vd:15701vd"; // Аутентификация Ниссан Волгодонск
	ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, ПодразделениеВолгодонск, ТекущаяДата);
КонецПроцедуры

Процедура ВыгрузкаДляRenaultAftersales(Параметры = Неопределено) Экспорт
	ТекущаяДата = НачалоДня(ТекущаяДата());
	//ТекущаяДата = Дата(2018, 5, 3); // дата для тестирования
		
	ПодразделениеШахтыРено = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000149");
	СтрокаАутентификации = "R3461\integr_sh:Olimp3461"; // Аутентификация Рено Шахты
	ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, ПодразделениеШахтыРено, ТекущаяДата);
	
	ПодразделениеВолгодонскРено = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000191");
	СтрокаАутентификации = "R3471\integr_vd:vd3471"; // Аутентификация Рено Волгодонск
	ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, ПодразделениеВолгодонскРено, ТекущаяДата);
КонецПроцедуры

Процедура ВыгрузкаДанныхДилерскогоЦентра(СтрокаАутентификации, Подразделение, ТекущаяДата)
	// устанавливаем соединение с сервером
	Таймаут = 120;
	SSL =  Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	Попытка
	    НТТР = Новый HTTPСоединение("customer360.ru", , , , , Таймаут, SSL); // Рабочий сервер
	    //НТТР = Новый HTTPСоединение("int2.nissan-aftersales.ru", , , , , Таймаут, SSL); // Тестовый сервер
	Исключение
		#Если Клиент Тогда
		Сообщить("Не удалось установить соединение с сервером:" 
		    	+ Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		#КонецЕсли
	    Возврат;
	КонецПопытки;
	
	Если стрНайти(СтрокаАутентификации, "21409201") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.DATSUN; // Датсун
		ГруппаПроизводителей = Справочники.Производители.Datsun;
		
	ИначеЕсли стрНайти(СтрокаАутентификации, "R3461") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.RENAULT; // Рено
		ГруппаПроизводителей = Справочники.Производители.Renault;
		
	ИначеЕсли стрНайти(СтрокаАутентификации, "R3471") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.RENAULT; // Рено
		ГруппаПроизводителей = Справочники.Производители.Renault;
		
	Иначе
		МаркаАвтомобилей = Справочники.Марка.NISSAN; // Ниссан
		ГруппаПроизводителей = Справочники.Производители.Nissan;
	КонецЕсли;
	
	// Заголовки запросов	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();   
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
    Запись.Записать(СтрокаАутентификации);
    Запись.Закрыть();    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    УдалитьФайлы(ВременныйФайл);	
	ЗаголовкиHTTP.Вставить("Authorization", "Basic " + Base64Строка(ДвДанные));	
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	// получение маркера доступа
	ЗапросHTTP.АдресРесурса = "/api/identity/connect/token";
	ЗапросHTTP.УстановитьТелоИзСтроки("grant_type=client_credentials&scope=int_aftersalesreports", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			#Если Клиент Тогда
			Сообщить("JSON-парсинг ответа на запрос токена:" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
			#КонецЕсли
			Возврат;
		КонецПопытки;
		МаркерДоступа = стОтвет.access_token;
		ТипМаркераДоступа = стОтвет.token_type;
	Иначе
		#Если Клиент Тогда	
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		Сообщить("Ошибка запроса токена:" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	// заголовки с маркером доступа	
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Authorization", ТипМаркераДоступа + " " + МаркерДоступа);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
		
	// Выгрузить отчет по машинозаездам
	ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/carvisitvins";
	//Если МаркаАвтомобилей = Справочники.Марка.RENAULT Тогда
		//	ТелоЗапроса = ОтчетПоМашинозаездамРено(ТекущаяДата, Подразделение, МаркаАвтомобилей);
		//Иначе
		//	ТелоЗапроса = ОтчетПоМашинозаездамНиссан(ТекущаяДата, Подразделение, МаркаАвтомобилей);
	//КонецЕсли;
	ТелоЗапроса = ОтчетПоМашинозаездамРено(ТекущаяДата, Подразделение, МаркаАвтомобилей);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	#Если Клиент Тогда	
	Если НТТРОтвет.КодСостояния > 299 Тогда
		Сообщить("Выгрузка отчёта по машинозаездам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
	КонецЕсли;		
	#КонецЕсли
	
	// Выгрузить отчет по продажам
	ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/partswholesale";
	ТелоЗапроса = ОтчетПоПродажам(ТекущаяДата, Подразделение, ГруппаПроизводителей);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	#Если Клиент Тогда	
	Если НТТРОтвет.КодСостояния > 299 Тогда
		Сообщить("Выгрузка отчёта по продажам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
	КонецЕсли;		
	#КонецЕсли
		
	// Выгрузить отчет по складским остаткам
	ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/partsstock";
	ТелоЗапроса = ОтчетПоСкладскимОстаткам(ТекущаяДата, Подразделение, ГруппаПроизводителей);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	#Если Клиент Тогда	
	Если НТТРОтвет.КодСостояния > 299 Тогда
		Сообщить("Выгрузка отчёта по складским остаткам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
	КонецЕсли;		
	#КонецЕсли
КонецПроцедуры

Функция ОтчетПоМашинозаездамНиссан(ТекущаяДата, Подразделение, МаркаАвтомобилей)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("МаркаАвтомобилей", МаркаАвтомобилей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДляОтчетаНиссан.VIN,
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядНомер,
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядДата,
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядТип,
	               |	ДанныеДляОтчетаНиссан.АвтомобильПробег,
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядСуммаРабот,
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядСуммаДеталей,
	               |	ДанныеДляОтчетаНиссан.Плательщик,
	               |	ДанныеДляОтчетаНиссан.ТипПродукта
	               |ИЗ
	               |	РегистрСведений.ДанныеДляОтчетаНиссан КАК ДанныеДляОтчетаНиссан
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК Автомобили
	               |		ПО ДанныеДляОтчетаНиссан.VIN = Автомобили.VIN
	               |ГДЕ
	               |	ДанныеДляОтчетаНиссан.ЗаказНарядДата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ДанныеДляОтчетаНиссан.Подразделение В ИЕРАРХИИ(&Подразделение)
	               |	И Автомобили.Модель.Марка = &МаркаАвтомобилей";
		
	мЗаказНаряды = Новый Массив();
	ТаблицаНевыгруженных = Запрос.Выполнить().Выгрузить();	
	Для Каждого СтрокаТаблицы Из ТаблицаНевыгруженных Цикл
		стЗаказНаряд = Новый Структура();
		стЗаказНаряд.Вставить("vin", СтрокаТаблицы.VIN);
		
		ДатаЗаказНаряда = Формат(Год(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=4;ЧГ=0;ЧВН=") + "-" + Формат(Месяц(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=2;ЧВН=") + "-" + Формат(День(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=2;ЧВН=") + "T00:00:00";
		стЗаказНаряд.Вставить("date", ДатаЗаказНаряда);
		
		стЗаказНаряд.Вставить("order_number", СтрокаТаблицы.ЗаказНарядНомер);		
		стЗаказНаряд.Вставить("order_Type", СтрокаТаблицы.ЗаказНарядТип);		
		стЗаказНаряд.Вставить("mileage", СтрокаТаблицы.АвтомобильПробег);
		стЗаказНаряд.Вставить("work_total", СтрокаТаблицы.ЗаказНарядСуммаРабот);
		стЗаказНаряд.Вставить("parts_total", СтрокаТаблицы.ЗаказНарядСуммаДеталей);
		стЗаказНаряд.Вставить("product_type", СтрокаТаблицы.ТипПродукта);
		стЗаказНаряд.Вставить("payer", СтрокаТаблицы.Плательщик);
		мЗаказНаряды.Добавить(стЗаказНаряд);
	КонецЦикла;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("year", Год(ТекущаяДата));
	стТелоЗапроса.Вставить("month", Месяц(ТекущаяДата));
	стТелоЗапроса.Вставить("items", мЗаказНаряды);

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные для выгрузки отчёта по машинозаездам!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Функция ОтчетПоПродажам(ТекущаяДата, Подразделение, ГруппаПроизводителей)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ГруппаПроизводителей", ГруппаПроизводителей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продажи.Регистратор КАК ДокументПродажи,
	               |	Продажи.Период КАК ДатаПродажи,
	               |	Продажи.Регистратор.Номер КАК ДокументНомер,
	               |	Продажи.Номенклатура.АртикулАЦ КАК Артикул,
	               |	Продажи.Покупатель,
	               |	СУММА(Продажи.Количество) КАК Количество,
	               |	СРЕДНЕЕ(Продажи.Сумма / Продажи.Количество) КАК СтоимостьЕдиницы
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |ГДЕ
	               |	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Продажи.ХозОперация В (ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд), ЗНАЧЕНИЕ(Справочник.ХозОперации.КомплектацияАвтомобиля), ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваров))
	               |	И Продажи.ПодразделениеКомпании В ИЕРАРХИИ(&Подразделение)
	               |	И НЕ Продажи.Покупатель.НашаФирма
	               |	И Продажи.Номенклатура.Производитель В ИЕРАРХИИ(&ГруппаПроизводителей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Регистратор.Номер,
	               |	Продажи.Номенклатура.АртикулАЦ,
	               |	Продажи.Покупатель,
	               |	Продажи.Регистратор,
	               |	Продажи.Период";
	
	мПродажи = Новый Массив();
	ТаблицаНевыгруженных = Запрос.Выполнить().Выгрузить();	
	Для Каждого СтрокаТаблицы Из ТаблицаНевыгруженных Цикл
		Если Не ПравильныйАртикул(СтрокаТаблицы.Артикул) Тогда
			Продолжить;
		КонецЕсли;
		
		стПродажа = Новый Структура();
		стПродажа.Вставить("dn", СтрокаТаблицы.ДокументНомер);
		
		ДатаРеализации = Формат(Год(СтрокаТаблицы.ДатаПродажи), "ЧЦ=4;ЧГ=0;ЧВН=") + "-" + Формат(Месяц(СтрокаТаблицы.ДатаПродажи), "ЧЦ=2;ЧВН=") + "-" + Формат(День(СтрокаТаблицы.ДатаПродажи), "ЧЦ=2;ЧВН=") + "T00:00:00";
		стПродажа.Вставить("realization", ДатаРеализации);
		
		стПродажа.Вставить("pn", СтрокаТаблицы.Артикул);		
		
		Если ТипЗнч(СтрокаТаблицы.ДокументПродажи) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			ВидРемонта = СтрокаТаблицы.ДокументПродажи.ВидРемонта;
			ЭтоКузовнойРемонт = (ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт Или ВидРемонта = Справочники.ВидыРемонта.КузовнойКоммерческий);
			Если ЭтоКузовнойРемонт Тогда
				КаналРеализации = "кузовной цех";
			Иначе
				КаналРеализации = "слесарный цех";
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТаблицы.ДокументПродажи) = Тип("ДокументСсылка.КомплектацияАвтомобиля") Тогда
			КаналРеализации = "доп";
		//Бондаренко++ 20201105	
		//Иначе
		//	Если СтрокаТаблицы.Покупатель.ОптовыйПокупатель Тогда
		//		КаналРеализации = "опт";
		//	Иначе
		//		КаналРеализации = "розница";
		//	КонецЕсли;
		//Бондаренко++ 20201105		
		ИначеЕсли ТипЗнч(СтрокаТаблицы.ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Если СтрокаТаблицы.ДокументПродажи.ОптоваяПродажа Тогда
				КаналРеализации = "опт";
			Иначе
				КаналРеализации = "розница";
			КонецЕсли;	
		Иначе
			КаналРеализации = "розница";
	    //Бондаренко-- 20201105	
 		КонецЕсли;
		стПродажа.Вставить("chn", КаналРеализации);
		
		стПродажа.Вставить("cnt", СтрокаТаблицы.Количество);
		стПродажа.Вставить("prc", СтрокаТаблицы.СтоимостьЕдиницы);
		мПродажи.Добавить(стПродажа);
	КонецЦикла;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("year", Год(ТекущаяДата));
	стТелоЗапроса.Вставить("month", Месяц(ТекущаяДата));
	стТелоЗапроса.Вставить("items", мПродажи);

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные для выгрузки отчёта по продажам!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Функция ОтчетПоСкладскимОстаткам(ТекущаяДата, Подразделение, ГруппаПроизводителей)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаВыборки", КонецДня(ТекущаяДата));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ГруппаПроизводителей", ГруппаПроизводителей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура.АртикулАЦ КАК Артикул,
	               |	ПартииТоваровКомпанииОстатки.Партия.Дата КАК ДатаПоступления,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&ДатаВыборки,
	               |			Номенклатура.Производитель В ИЕРАРХИИ (&ГруппаПроизводителей)
	               |				И Партия.ПодразделениеКомпании В ИЕРАРХИИ (&Подразделение)) КАК ПартииТоваровКомпанииОстатки
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0";
		
	мОстатки = Новый Массив();
	ТаблицаНевыгруженных = Запрос.Выполнить().Выгрузить();	
	Для Каждого СтрокаТаблицы Из ТаблицаНевыгруженных Цикл
		Если Не ПравильныйАртикул(СтрокаТаблицы.Артикул) Тогда
			Продолжить;
		КонецЕсли;
		
		стОстаток = Новый Структура();
		стОстаток.Вставить("pn", СтрокаТаблицы.Артикул);		
		стОстаток.Вставить("qty", СтрокаТаблицы.Количество);
		
		ДатаПоступления = Формат(Год(СтрокаТаблицы.ДатаПоступления), "ЧЦ=4;ЧГ=0;ЧВН=") + "-" + Формат(Месяц(СтрокаТаблицы.ДатаПоступления), "ЧЦ=2;ЧВН=") + "-" + Формат(День(СтрокаТаблицы.ДатаПоступления), "ЧЦ=2;ЧВН=") + "T00:00:00";
		стОстаток.Вставить("arrived", ДатаПоступления);
		
		мОстатки.Добавить(стОстаток);
	КонецЦикла;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("year", Год(ТекущаяДата));
	стТелоЗапроса.Вставить("month", Месяц(ТекущаяДата));
	стТелоЗапроса.Вставить("items", мОстатки);

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные для выгрузки отчёта по остаткам!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

Функция ПравильныйАртикул(Артикул)
	Длина = СтрДлина(Артикул);
	Если Длина < 7 Или Длина > 16 Тогда
		Возврат Ложь;
	КонецЕсли;
	// усеченный вариант "0123456789ABCDEFGHJKLMNPRSTUVWXYZ"
	Для сч = 1 По Длина Цикл
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Артикул, сч, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Истина;
КонецФункции

Функция ОтчетПоМашинозаездамРено(ТекущаяДата, Подразделение, МаркаАвтомобилей)
	мСостояния = Новый Массив();
	мСостояния.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Выполнен);
	мСостояния.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
	ЗапросЗН = Новый Запрос();
	ЗапросЗН.УстановитьПараметр("ВыполненИлиЗакрыт", мСостояния);
	ЗапросЗН.УстановитьПараметр("Подразделение", Подразделение);
	ЗапросЗН.УстановитьПараметр("МаркаАвтомобилей", МаркаАвтомобилей);
	ЗапросЗН.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));
	ЗапросЗН.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));
	ЗапросЗН.Текст = "ВЫБРАТЬ
	                 |	ЗаказНаряд.Дата КАК ЗаказНарядДата,
	                 |	ЗаказНаряд.Номер КАК Номер,
	                 |	ЗаказНаряд.Автомобиль.VIN КАК VIN,
	                 |	ЗаказНаряд.Пробег КАК Пробег,
	                 |	ЗаказНаряд.СуммаРаботДокумента КАК СуммаРабот,
	                 |	ЗаказНаряд.СуммаНоменклатурыДокумента КАК СуммаЗапчастей,
	                 |	ЗаказНаряд.ВидРемонта.Наименование КАК НаименованиеВидаРемонта,
	                 |	ЗаказНаряд.Контрагент.ФормаСобственности КАК КонтрагентФС,
	                 |	ЗаказНаряд.Цех КАК Цех,
	                 |	ЗаказНаряд.Состояние КАК Состояние,
	                 |	ЗаказНаряд.ВидРемонта КАК ВидРемонта
	                 |ИЗ
	                 |	Документ.ЗаказНаряд КАК ЗаказНаряд
	                 |ГДЕ
	                 |	ЗаказНаряд.Состояние В(&ВыполненИлиЗакрыт)
	                 |	И ЗаказНаряд.ПодразделениеКомпании В ИЕРАРХИИ(&Подразделение)
	                 |	И ЗаказНаряд.Автомобиль.Модель.Марка = &МаркаАвтомобилей
	                 |	И ЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
	мЗаказНаряды = Новый Массив();
	ТаблицаНевыгруженных = ЗапросЗН.Выполнить().Выгрузить();	
	Для Каждого СтрокаТаблицы Из ТаблицаНевыгруженных Цикл
		Если СтрокаТаблицы.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен 
			И Не СтрокаТаблицы.ВидРемонта.ГарантияЗавода Тогда
			Продолжить;
		КонецЕсли;
		
		стЗаказНаряд = Новый Структура();
		стЗаказНаряд.Вставить("vin", СтрокаТаблицы.VIN);	
		ДатаЗаказНаряда = Формат(Год(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=4;ЧГ=0;ЧВН=") + "-" + Формат(Месяц(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=2;ЧВН=") + "-" + Формат(День(СтрокаТаблицы.ЗаказНарядДата), "ЧЦ=2;ЧВН=") + "T00:00:00";
		стЗаказНаряд.Вставить("date", ДатаЗаказНаряда);
		
		Если СтрокаТаблицы.ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт Тогда
			стЗаказНаряд.Вставить("order_Type", "КР");
			стЗаказНаряд.Вставить("product_type", "КЛИЕНТ");
			стЗаказНаряд.Вставить("payer", "КЛИЕНТ");
			
		ИначеЕсли СтрокаТаблицы.ВидРемонта = Справочники.ВидыРемонта.КузовнойКоммерческий Тогда
			стЗаказНаряд.Вставить("order_Type", "КР");
			стЗаказНаряд.Вставить("product_type", "КЛИЕНТ");
			стЗаказНаряд.Вставить("payer", "КЛИЕНТ");
			
		ИначеЕсли Найти(СтрокаТаблицы.НаименованиеВидаРемонта, "Техническое") > 0 Тогда
			стЗаказНаряд.Вставить("order_Type", "ТО");
			
		ИначеЕсли СтрокаТаблицы.ВидРемонта.ГарантияЗавода Тогда
			стЗаказНаряд.Вставить("order_Type", "Гарантия");
			
		ИначеЕсли СтрокаТаблицы.ВидРемонта = Справочники.ВидыРемонта.СезоннаяКомпания Тогда
			стЗаказНаряд.Вставить("order_Type", "Сезонная кампания");
			
		ИначеЕсли СтрокаТаблицы.ВидРемонта = Справочники.ВидыРемонта.МасляныйСервис Тогда
			стЗаказНаряд.Вставить("order_Type", "Масляный сервис");
			
		ИначеЕсли Найти(СтрокаТаблицы.НаименованиеВидаРемонта, "Дополнительное") > 0 Тогда
			Если СтрокаТаблицы.КонтрагентФС = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				стЗаказНаряд.Вставить("order_Type", "ДОП ритэйл");
			Иначе
				стЗаказНаряд.Вставить("order_Type", "ДОП флит");
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			стЗаказНаряд.Вставить("order_Type", "ВН/Д");
			
		Иначе
			стЗаказНаряд.Вставить("order_Type", "МР/АСС");
		КонецЕсли;
		
		стЗаказНаряд.Вставить("order_number", СокрЛП(СтрокаТаблицы.Номер));			
		стЗаказНаряд.Вставить("mileage", СтрокаТаблицы.Пробег);
		стЗаказНаряд.Вставить("work_total", СтрокаТаблицы.СуммаРабот);
		стЗаказНаряд.Вставить("parts_total", СтрокаТаблицы.СуммаЗапчастей);
		
		мЗаказНаряды.Добавить(стЗаказНаряд);
	КонецЦикла;
	
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("year", Год(ТекущаяДата));
	стТелоЗапроса.Вставить("month", Месяц(ТекущаяДата));
	стТелоЗапроса.Вставить("items", мЗаказНаряды);

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
	#Если Клиент Тогда	
		Сообщить("Не удалось записать JSON-данные для выгрузки отчёта по машинозаездам!", СтатусСообщения.Внимание);
	#КонецЕсли
		Возврат "";
	КонецПопытки;
	
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Возврат ТелоЗапроса;
КонецФункции

///////////////////////////////////////////////////////////////////////
// Процедуры для Customer360 CRM API
///////////////////////////////////////////////////////////////////////

Функция СтрокаАутентификации(КодДилера) Экспорт
	СтрокаАутентификации = "";
	Если КодДилера = "21112401" Тогда
		//СтрокаАутентификации = "21112401\dealer_crm:demo_123"; // Аутентификация Ниссан Шахты для тестового сервера
		СтрокаАутентификации = "21112401\integr_sh:12401sh"; // Аутентификация Ниссан Шахты
	ИначеЕсли КодДилера = "21409201" Тогда
		//СтрокаАутентификации = "21409201\dealer_crm:demo_123"; // Аутентификация Датсун Шахты для тестового сервера
		СтрокаАутентификации = "21409201\integr_sh:Olimp62"; // Аутентификация Датсун Шахты
	ИначеЕсли КодДилера = "21115701" Тогда
		//СтрокаАутентификации = "21115701\dealer_crm:demo_123"; // Аутентификация Ниссан Волгодонск для тестового сервера
		СтрокаАутентификации = "21115701\integr_vd:15701vd"; // Аутентификация Ниссан Волгодонск
	КонецЕсли;
	Возврат СтрокаАутентификации;
КонецФункции

Функция ОбновитьСтатусЛида(КодДилера, ЛидИД, НовыйСтатус, Параметры) Экспорт
	стОшибка = Новый Структура("error, is_success");
	Если Не СМ_УправлениеДоступом.ЭтоРабочаяБаза() Тогда
		стОшибка.error = "Обновление статуса лида возможно только из рабочей базы!";
		стОшибка.is_success = Ложь;
		Возврат стОшибка;
	КонецЕсли;
	
	// устанавливаем соединение с сервером
	Таймаут = 120;
	SSL =  Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());

    НТТР = Новый HTTPСоединение("customer360.ru", , , , , Таймаут, SSL); // Рабочий сервер
    //НТТР = Новый HTTPСоединение("int2.nissan-aftersales.ru", , , , , Таймаут, SSL); // Тестовый сервер
	
	// Заголовки запросов	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();   
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
	стрАутентификации = СтрокаАутентификации(КодДилера);
    Запись.Записать(стрАутентификации);
    Запись.Закрыть();    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    УдалитьФайлы(ВременныйФайл);	
	ЗаголовкиHTTP.Вставить("Authorization", "Basic " + Base64Строка(ДвДанные));	
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	// получение маркера доступа
	ЗапросHTTP.АдресРесурса = "/api/identity/connect/token";
	ЗапросHTTP.УстановитьТелоИзСтроки("grant_type=client_credentials&scope=int_leadcrm", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
			МаркерДоступа = стОтвет.access_token;
			ТипМаркераДоступа = стОтвет.token_type;
		Исключение
			стОшибка.error = "Обновить статус лида: ошибка JSON-парсинга тела ответа на запрос токена!";
			стОшибка.is_success = Ложь;
			#Если Клиент Тогда
			Сообщить(стОшибка.error, СтатусСообщения.Важное);
			#КонецЕсли
			Возврат стОшибка;
		КонецПопытки;
		
	Иначе
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		СообщениеОшибка = "Обновить статус лида: ошибка запроса токена:" + Символы.ПС
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета;
		стОшибка.error = СообщениеОшибка;
		стОшибка.is_success = Ложь;
		#Если Клиент Тогда	
		Сообщить(СообщениеОшибка, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат стОшибка;
	КонецЕсли;
	
	// заголовки с маркером доступа	
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Authorization", ТипМаркераДоступа + " " + МаркерДоступа);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
		
	стТелоЗапроса = Новый Структура();
	стТелоЗапроса.Вставить("status", НовыйСтатус);
	стТелоЗапроса.Вставить("lead_id", ЛидИД);
	
	Если Параметры.Свойство("dealer_visit_planned_date") Тогда
		стТелоЗапроса.Вставить("dealer_visit_planned_date", Параметры.dealer_visit_planned_date);
	КонецЕсли;
	Если Параметры.Свойство("dealer_recall_date") Тогда
		стТелоЗапроса.Вставить("dealer_recall_date", Параметры.dealer_recall_date);
	КонецЕсли;
	Если Параметры.Свойство("status_comment") Тогда
		стТелоЗапроса.Вставить("status_comment", Параметры.status_comment);
	КонецЕсли;
	
	Если НовыйСтатус = "refuse" Тогда // Отказ
		Если Параметры.Свойство("dealer_refuse_reason_id") И ЗначениеЗаполнено(Параметры.dealer_refuse_reason_id) Тогда
			стТелоЗапроса.Вставить("dealer_refuse_reason_id", Параметры.dealer_refuse_reason_id);
		Иначе
			стТелоЗапроса.Вставить("dealer_refuse_reason_id", 4); //Прочее
		КонецЕсли;
		Если Параметры.Свойство("refuse_reason_comment") Тогда
			стТелоЗапроса.Вставить("refuse_reason_comment", Параметры.refuse_reason_comment);
		Иначе
			стТелоЗапроса.Вставить("refuse_reason_comment", "");
		КонецЕсли;	
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
		стОшибка.error = "Обновить статус лида: не удалось записать JSON-данные для запроса!";
		стОшибка.is_success = Ложь;
		#Если Клиент Тогда	
		Сообщить(стОшибка.error, СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат стОшибка;
	КонецПопытки;

	// Запрос обновления статуса лида
	ЗапросHTTP.АдресРесурса = "/api/v1/crm/status";
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
			#Если Клиент Тогда	
			Если Не стОтвет.is_success Тогда
				Сообщить(стОтвет.error, СтатусСообщения.Внимание);
			КонецЕсли;	
			#КонецЕсли
			Возврат стОтвет;
			
		Исключение
			стОшибка.error = "Обновить статус лида: не удалось извлечь JSON-данные из тела ответа сервера!";
			стОшибка.is_success = Ложь;
			#Если Клиент Тогда	
			Сообщить(стОшибка.error, СтатусСообщения.Внимание);
			#КонецЕсли
			Возврат стОшибка;
		КонецПопытки;	
		
	Иначе
		СообщениеОшибка = "Обновить статус лида " + ЛидИД + ":" + Символы.ПС
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета;
		стОшибка.error = СообщениеОшибка;
		стОшибка.is_success = Ложь;
		#Если Клиент Тогда	
		Сообщить(СообщениеОшибка, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат стОшибка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЛида(ЛидИД, СтрокаАутентификации) Экспорт
	// устанавливаем соединение с сервером
	Таймаут = 120;
	SSL =  Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());

    НТТР = Новый HTTPСоединение("customer360.ru", , , , , Таймаут, SSL); // Рабочий сервер
    //НТТР = Новый HTTPСоединение("int2.nissan-aftersales.ru", , , , , Таймаут, SSL); // Тестовый сервер
	
	// Заголовки запросов	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();   
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
    Запись.Записать(СтрокаАутентификации);
    Запись.Закрыть();    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    УдалитьФайлы(ВременныйФайл);	
	ЗаголовкиHTTP.Вставить("Authorization", "Basic " + Base64Строка(ДвДанные));	
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	// получение маркера доступа
	ЗапросHTTP.АдресРесурса = "/api/identity/connect/token";
	ЗапросHTTP.УстановитьТелоИзСтроки("grant_type=client_credentials&scope=int_leadcrm", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
			МаркерДоступа = стОтвет.access_token;
			ТипМаркераДоступа = стОтвет.token_type;
		Исключение
			стОшибка = Новый Структура("error", "Получить данные лида: ошибка JSON-парсинга тела ответа на запрос токена!");
			#Если Клиент Тогда
			Сообщить(стОшибка.error, СтатусСообщения.Важное);
			#КонецЕсли
			Возврат стОшибка;
		КонецПопытки;
		
	Иначе
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		СообщениеОшибка = "Получить данные лида: ошибка запроса токена:" + Символы.ПС
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета;
		стОшибка = Новый Структура("error", СообщениеОшибка);
		#Если Клиент Тогда	
		Сообщить(СообщениеОшибка, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат стОшибка;
	КонецЕсли;
	
	// заголовки с маркером доступа	
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Authorization", ТипМаркераДоступа + " " + МаркерДоступа);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
		
	стТелоЗапроса = Новый Структура("lead_id", ЛидИД);
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(ЗаписьJSON, стТелоЗапроса);
	Исключение
		стОшибка = Новый Структура("error", "Получить данные лида: не удалось записать JSON-данные для запроса!");
		#Если Клиент Тогда	
		Сообщить(стОшибка.error, СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат стОшибка;
	КонецПопытки;

	// Запрос данных лида
	ЗапросHTTP.АдресРесурса = "/api/v1/crm/lead";
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	
	ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стДанныеЛида = ПрочитатьJSON(ЧтениеJSON);
			Возврат стДанныеЛида;
		Исключение
			стОшибка = Новый Структура("error", "Получить данные лида: некорректный JSON в теле ответа сервера!");
			#Если Клиент Тогда	
			Сообщить(стОшибка.error, СтатусСообщения.Внимание);
			#КонецЕсли
			Возврат стОшибка;
		КонецПопытки;
		
	Иначе
		СообщениеОшибка = "Получить данные лида " + ЛидИД + ":" + Символы.ПС
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета;
		стОшибка = Новый Структура("error", СообщениеОшибка);
		#Если Клиент Тогда	
		Сообщить(СообщениеОшибка, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат стОшибка;
	КонецЕсли;
КонецФункции

Процедура ОбновитьСтатусЛидаПоРЛСервиса(РабочийЛистСсылка) Экспорт
	Если ТипЗнч(РабочийЛистСсылка) <> Тип("ДокументСсылка.РабочийЛистСервиса") Тогда
		Возврат;
	КонецЕсли;

	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.СсылкаНаОбъект.Значение = РабочийЛистСсылка;
	нзКонтакты.Отбор.СсылкаНаОбъект.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = РабочийЛистСсылка;
	мзКонтакт.ЛидИД = нзКонтакты[0].ЛидИД;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	ТекущийСтатус = РабочийЛистСсылка.Статус;
	Если ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.Отказ Тогда
		НовыйСтатус = "refuse";
		ПричинаОтказа = РабочийЛистСсылка.ПричинаОтказа;
		Если ЗначениеЗаполнено(ПричинаОтказа) Тогда
			Параметры.Вставить("dealer_refuse_reason_id", ПричинаОтказа.КодCustomer360);
			Параметры.Вставить("refuse_reason_comment", Строка(ПричинаОтказа));
		КонецЕсли;
		
	ИначеЕсли ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
		НовыйСтатус = "served";
		
	ИначеЕсли ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.ОшибочныйНомер Тогда
		НовыйСтатус = "bad_phone";
		
	Иначе
		Возврат;
	КонецЕсли;
	
	стРезультат = ОбновитьСтатусЛида(мзКонтакт.КодДилера, мзКонтакт.ЛидИД, НовыйСтатус, Параметры);	
	Если стРезультат.is_success Тогда
		мзКонтакт.ЛидЗакрыт = Истина;
		мзКонтакт.ДатаИзменения = ТекущаяДата();
		мзКонтакт.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьСтатусЛидаПоРЛ(ДокументСсылка) Экспорт
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РабочийЛист") Тогда
		РабочийЛистСсылка = ДокументСсылка;
	Иначе
		Возврат;
	КонецЕсли;

	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.СсылкаНаОбъект.Значение = РабочийЛистСсылка;
	нзКонтакты.Отбор.СсылкаНаОбъект.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = РабочийЛистСсылка;
	мзКонтакт.ЛидИД = нзКонтакты[0].ЛидИД;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	ТекущийСтатус = РабочийЛистСсылка.Статус;
	Если ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.Отказ Тогда
		НовыйСтатус = "refuse";
		ПричинаОтказа = РабочийЛистСсылка.ПричинаОтказа;
		Если ЗначениеЗаполнено(ПричинаОтказа) Тогда
			Параметры.Вставить("dealer_refuse_reason_id", ПричинаОтказа.КодCustomer360);
			Параметры.Вставить("refuse_reason_comment", Строка(ПричинаОтказа));
		КонецЕсли;
		
	ИначеЕсли ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.ОшибочныйНомер Тогда
		НовыйСтатус = "bad_phone";
		
	ИначеЕсли ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.Сделка Тогда
		НовыйСтатус = "contract";
		
	ИначеЕсли ТекущийСтатус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
		НовыйСтатус = "contract";
		Если РабочийЛистСсылка.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет Тогда	
			Если мзКонтакт.КодТипаЛида = 12 Или мзКонтакт.КодТипаЛида = 13 Или
				мзКонтакт.КодТипаЛида = 51 Или мзКонтакт.КодТипаЛида = 52 Тогда
				НовыйСтатус = "cash_sale";
			КонецЕсли;
		КонецЕсли;
				
	Иначе
		Возврат;
	КонецЕсли;
	
	стРезультат = ОбновитьСтатусЛида(мзКонтакт.КодДилера, мзКонтакт.ЛидИД, НовыйСтатус, Параметры);	
	Если стРезультат.is_success Тогда
		мзКонтакт.ЛидЗакрыт = Истина;
		мзКонтакт.ДатаИзменения = ТекущаяДата();
		мзКонтакт.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьСтатусЛидаПоСобытию(ДокументСсылка) Экспорт
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Событие") Тогда
		ДокументОснование = ДокументСсылка.ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РабочийЛист") Тогда
			РабочийЛистСсылка = ДокументОснование;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.СсылкаНаОбъект.Значение = РабочийЛистСсылка;
	нзКонтакты.Отбор.СсылкаНаОбъект.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = РабочийЛистСсылка;
	мзКонтакт.ЛидИД = нзКонтакты[0].ЛидИД;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	НовыйСтатус = "";
	
	ВидСобытия = ДокументСсылка.ВидСобытия;
	Если ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок И ДокументСсылка.ТипСообщения = Перечисления.ТипыСообщений.Исходящее
		И ДокументСсылка.Состояние = Перечисления.СостоянияСобытий.Запланировано Тогда
		НовыйСтатус = "call_back"; // Перезвонить
		Параметры.Вставить("dealer_recall_date", ЗаписатьДатуJSON(ДокументСсылка.ДатаНачала, ФорматДатыJSON.ISO));
		Содержание = ДокументСсылка.Содержание;
		Если ЗначениеЗаполнено(Содержание) Тогда
			Параметры.Вставить("status_comment", Содержание);
		КонецЕсли;
		
	ИначеЕсли ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
		Если ДокументСсылка.Состояние = Перечисления.СостоянияСобытий.Запланировано Тогда
			НовыйСтатус = "visit_planned"; // Назначена дата визита
			Параметры.Вставить("dealer_visit_planned_date", ЗаписатьДатуJSON(ДокументСсылка.ДатаНачала, ФорматДатыJSON.ISO));
			Содержание = ДокументСсылка.Содержание;
			Если ЗначениеЗаполнено(Содержание) Тогда
				Параметры.Вставить("status_comment", Содержание);
			КонецЕсли;
			
		ИначеЕсли ДокументСсылка.Состояние = Перечисления.СостоянияСобытий.Завершено Тогда
			НовыйСтатус = "visit_completed"; // Встреча состоялась
			Результат = ДокументСсылка.Результат;
			Если ЗначениеЗаполнено(Результат) Тогда
				Параметры.Вставить("status_comment", Результат);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСтатус) Тогда
		стРезультат = ОбновитьСтатусЛида(мзКонтакт.КодДилера, мзКонтакт.ЛидИД, НовыйСтатус, Параметры);	
		Если стРезультат.is_success Тогда
			мзКонтакт.ДатаИзменения = ТекущаяДата();
			мзКонтакт.Записать();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// Для ручной выгрузки After-Sales
/////////////////////////////////////////////////////////////////////////

Процедура ВыгрузитьДанныеAftersales(Подразделение, ТекущаяДата, ВидыДанных) Экспорт
	ПодразделениеШахты = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160");	
	ПодразделениеВолгодонск = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190");
	ПодразделениеШахтыРено = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000149");
	ПодразделениеВолгодонскРено = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000191");
	
	Если Подразделение = ПодразделениеШахты Тогда
		СтрокаАутентификации = "21112401\integr_sh:12401sh"; // Аутентификация Ниссан Шахты
		//СтрокаАутентификации = "21409201\integr_sh:Olimp62"; // Аутентификация Датсун Шахты
		
	ИначеЕсли Подразделение = ПодразделениеВолгодонск Тогда
		СтрокаАутентификации = "21115701\integr_vd:15701vd"; // Аутентификация Ниссан Волгодонск
		
	ИначеЕсли Подразделение = ПодразделениеШахтыРено Тогда
		СтрокаАутентификации = "R3461\integr_sh:Olimp3461"; // Аутентификация Рено Шахты
		
	ИначеЕсли Подразделение = ПодразделениеВолгодонскРено Тогда
		СтрокаАутентификации = "R3471\integr_vd:vd3471"; // Аутентификация Рено Волгодонск
		
	Иначе
		Возврат;
	КонецЕсли;
	
	// устанавливаем соединение с сервером
	Таймаут = 120;
	SSL =  Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	Попытка
	    НТТР = Новый HTTPСоединение("customer360.ru", , , , , Таймаут, SSL); // Рабочий сервер
	    //НТТР = Новый HTTPСоединение("int2.nissan-aftersales.ru", , , , , Таймаут, SSL); // Тестовый сервер
	Исключение
		#Если Клиент Тогда
		Сообщить("Не удалось установить соединение с сервером:" 
		    	+ Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		#КонецЕсли
	    Возврат;
	КонецПопытки;
	
	Если стрНайти(СтрокаАутентификации, "21409201") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.DATSUN; // Датсун
		ГруппаПроизводителей = Справочники.Производители.Datsun;
		
	ИначеЕсли стрНайти(СтрокаАутентификации, "R3461") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.RENAULT; // Рено
		ГруппаПроизводителей = Справочники.Производители.Renault;
		
	ИначеЕсли стрНайти(СтрокаАутентификации, "R3471") > 0 Тогда
		МаркаАвтомобилей = Справочники.Марка.RENAULT; // Рено
		ГруппаПроизводителей = Справочники.Производители.Renault;
		
	Иначе
		МаркаАвтомобилей = Справочники.Марка.NISSAN; // Ниссан
		ГруппаПроизводителей = Справочники.Производители.Nissan;
	КонецЕсли;
	
	// Заголовки запросов	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();   
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
    Запись.Записать(СтрокаАутентификации);
    Запись.Закрыть();    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    УдалитьФайлы(ВременныйФайл);	
	ЗаголовкиHTTP.Вставить("Authorization", "Basic " + Base64Строка(ДвДанные));	
	
	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	// получение маркера доступа
	ЗапросHTTP.АдресРесурса = "/api/identity/connect/token";
	ЗапросHTTP.УстановитьТелоИзСтроки("grant_type=client_credentials&scope=int_aftersalesreports", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
	НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
	Если НТТРОтвет.КодСостояния < 300 Тогда
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Попытка
			стОтвет = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			#Если Клиент Тогда
			Сообщить("JSON-парсинг ответа на запрос токена:" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
			#КонецЕсли
			Возврат;
		КонецПопытки;
		МаркерДоступа = стОтвет.access_token;
		ТипМаркераДоступа = стОтвет.token_type;
	Иначе
		#Если Клиент Тогда	
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		Сообщить("Ошибка запроса токена:" + Символы.ПС 
		+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
		+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	// заголовки с маркером доступа	
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Authorization", ТипМаркераДоступа + " " + МаркерДоступа);
	ЗапросHTTP.Заголовки = ЗаголовкиHTTP;
	
	Если ВидыДанных.Машинозаезды Тогда
		// Выгрузить отчет по машинозаездам
		ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/carvisitvins";
		//Если МаркаАвтомобилей = Справочники.Марка.RENAULT Тогда
		//	ТелоЗапроса = ОтчетПоМашинозаездамРено(ТекущаяДата, Подразделение, МаркаАвтомобилей);
		//Иначе
		//	ТелоЗапроса = ОтчетПоМашинозаездамНиссан(ТекущаяДата, Подразделение, МаркаАвтомобилей);
		//КонецЕсли;
		ТелоЗапроса = ОтчетПоМашинозаездамРено(ТекущаяДата, Подразделение, МаркаАвтомобилей);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
		
		НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		#Если Клиент Тогда	
		Если НТТРОтвет.КодСостояния > 299 Тогда
			Сообщить("Выгрузка отчёта по машинозаездам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		КонецЕсли;		
		#КонецЕсли
	КонецЕсли;
	
	Если ВидыДанных.Продажи Тогда
		// Выгрузить отчет по продажам
		ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/partswholesale";
		ТелоЗапроса = ОтчетПоПродажам(ТекущаяДата, Подразделение, ГруппаПроизводителей);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
		
		НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		#Если Клиент Тогда	
		Если НТТРОтвет.КодСостояния > 299 Тогда
			Сообщить("Выгрузка отчёта по продажам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		КонецЕсли;		
		#КонецЕсли
	КонецЕсли;
	
	Если ВидыДанных.СкладскиеОстатки Тогда
		// Выгрузить отчет по складским остаткам
		ЗапросHTTP.АдресРесурса = "/api/v1/aftersalesreports/partsstock";
		ТелоЗапроса = ОтчетПоСкладскимОстаткам(ТекущаяДата, Подразделение, ГруппаПроизводителей);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);		
		
		НТТРОтвет = НТТР.ОтправитьДляОбработки(ЗапросHTTP);	
		ТелоОтвета = НТТРОтвет.ПолучитьТелоКакСтроку();
		#Если Клиент Тогда	
		Если НТТРОтвет.КодСостояния > 299 Тогда
			Сообщить("Выгрузка отчёта по складским остаткам от " + Формат(ТекущаяДата, "ДЛФ=Д") + ":" + Символы.ПС 
			+ "Код состояния: " + НТТРОтвет.КодСостояния  + Символы.ПС 
			+ "Тело ответа: " + ТелоОтвета, СтатусСообщения.Важное);
		КонецЕсли;		
		#КонецЕсли
	КонецЕсли;	
КонецПроцедуры
